zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/component/isi.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_PSIZE_OFFSET                    (0x08)                                        /**<  (ISI_PSIZE) ISI Preview Size Register  Offset */

#define ISI_PSIZE_PREV_VSIZE_Pos            0                                              /**< (ISI_PSIZE) Vertical Size for the Preview Path Position */
#define ISI_PSIZE_PREV_VSIZE_Msk            (_U_(0x3FF) << ISI_PSIZE_PREV_VSIZE_Pos)       /**< (ISI_PSIZE) Vertical Size for the Preview Path Mask */
#define ISI_PSIZE_PREV_VSIZE(value)         (ISI_PSIZE_PREV_VSIZE_Msk & ((value) << ISI_PSIZE_PREV_VSIZE_Pos))
#define ISI_PSIZE_PREV_HSIZE_Pos            16                                             /**< (ISI_PSIZE) Horizontal Size for the Preview Path Position */
#define ISI_PSIZE_PREV_HSIZE_Msk            (_U_(0x3FF) << ISI_PSIZE_PREV_HSIZE_Pos)       /**< (ISI_PSIZE) Horizontal Size for the Preview Path Mask */
#define ISI_PSIZE_PREV_HSIZE(value)         (ISI_PSIZE_PREV_HSIZE_Msk & ((value) << ISI_PSIZE_PREV_HSIZE_Pos))
#define ISI_PSIZE_MASK                      _U_(0x3FF03FF)                                 /**< \deprecated (ISI_PSIZE) Register MASK  (Use ISI_PSIZE_Msk instead)  */
#define ISI_PSIZE_Msk                       _U_(0x3FF03FF)                                 /**< (ISI_PSIZE) Register Mask  */


/* -------- ISI_PDECF : (ISI Offset: 0x0c) (R/W 32) ISI Preview Decimation Factor Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DEC_FACTOR:8;              /**< bit:   0..7  Decimation Factor                        */
    uint32_t :24;                       /**< bit:  8..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_PDECF_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_PDECF_OFFSET                    (0x0C)                                        /**<  (ISI_PDECF) ISI Preview Decimation Factor Register  Offset */

#define ISI_PDECF_DEC_FACTOR_Pos            0                                              /**< (ISI_PDECF) Decimation Factor Position */
#define ISI_PDECF_DEC_FACTOR_Msk            (_U_(0xFF) << ISI_PDECF_DEC_FACTOR_Pos)        /**< (ISI_PDECF) Decimation Factor Mask */
#define ISI_PDECF_DEC_FACTOR(value)         (ISI_PDECF_DEC_FACTOR_Msk & ((value) << ISI_PDECF_DEC_FACTOR_Pos))
#define ISI_PDECF_MASK                      _U_(0xFF)                                      /**< \deprecated (ISI_PDECF) Register MASK  (Use ISI_PDECF_Msk instead)  */
#define ISI_PDECF_Msk                       _U_(0xFF)                                      /**< (ISI_PDECF) Register Mask  */


/* -------- ISI_Y2R_SET0 : (ISI Offset: 0x10) (R/W 32) ISI Color Space Conversion YCrCb To RGB Set 0 Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t C0:8;                      /**< bit:   0..7  Color Space Conversion Matrix Coefficient C0 */
    uint32_t C1:8;                      /**< bit:  8..15  Color Space Conversion Matrix Coefficient C1 */
    uint32_t C2:8;                      /**< bit: 16..23  Color Space Conversion Matrix Coefficient C2 */
    uint32_t C3:8;                      /**< bit: 24..31  Color Space Conversion Matrix Coefficient C3 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_Y2R_SET0_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_Y2R_SET0_OFFSET                 (0x10)                                        /**<  (ISI_Y2R_SET0) ISI Color Space Conversion YCrCb To RGB Set 0 Register  Offset */

#define ISI_Y2R_SET0_C0_Pos                 0                                              /**< (ISI_Y2R_SET0) Color Space Conversion Matrix Coefficient C0 Position */
#define ISI_Y2R_SET0_C0_Msk                 (_U_(0xFF) << ISI_Y2R_SET0_C0_Pos)             /**< (ISI_Y2R_SET0) Color Space Conversion Matrix Coefficient C0 Mask */
#define ISI_Y2R_SET0_C0(value)              (ISI_Y2R_SET0_C0_Msk & ((value) << ISI_Y2R_SET0_C0_Pos))
#define ISI_Y2R_SET0_C1_Pos                 8                                              /**< (ISI_Y2R_SET0) Color Space Conversion Matrix Coefficient C1 Position */
#define ISI_Y2R_SET0_C1_Msk                 (_U_(0xFF) << ISI_Y2R_SET0_C1_Pos)             /**< (ISI_Y2R_SET0) Color Space Conversion Matrix Coefficient C1 Mask */
#define ISI_Y2R_SET0_C1(value)              (ISI_Y2R_SET0_C1_Msk & ((value) << ISI_Y2R_SET0_C1_Pos))
#define ISI_Y2R_SET0_C2_Pos                 16                                             /**< (ISI_Y2R_SET0) Color Space Conversion Matrix Coefficient C2 Position */
#define ISI_Y2R_SET0_C2_Msk                 (_U_(0xFF) << ISI_Y2R_SET0_C2_Pos)             /**< (ISI_Y2R_SET0) Color Space Conversion Matrix Coefficient C2 Mask */
#define ISI_Y2R_SET0_C2(value)              (ISI_Y2R_SET0_C2_Msk & ((value) << ISI_Y2R_SET0_C2_Pos))
#define ISI_Y2R_SET0_C3_Pos                 24                                             /**< (ISI_Y2R_SET0) Color Space Conversion Matrix Coefficient C3 Position */
#define ISI_Y2R_SET0_C3_Msk                 (_U_(0xFF) << ISI_Y2R_SET0_C3_Pos)             /**< (ISI_Y2R_SET0) Color Space Conversion Matrix Coefficient C3 Mask */
#define ISI_Y2R_SET0_C3(value)              (ISI_Y2R_SET0_C3_Msk & ((value) << ISI_Y2R_SET0_C3_Pos))
#define ISI_Y2R_SET0_MASK                   _U_(0xFFFFFFFF)                                /**< \deprecated (ISI_Y2R_SET0) Register MASK  (Use ISI_Y2R_SET0_Msk instead)  */
#define ISI_Y2R_SET0_Msk                    _U_(0xFFFFFFFF)                                /**< (ISI_Y2R_SET0) Register Mask  */


/* -------- ISI_Y2R_SET1 : (ISI Offset: 0x14) (R/W 32) ISI Color Space Conversion YCrCb To RGB Set 1 Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t C4:9;                      /**< bit:   0..8  Color Space Conversion Matrix Coefficient C4 */
    uint32_t :3;                        /**< bit:  9..11  Reserved */
    uint32_t Yoff:1;                    /**< bit:     12  Color Space Conversion Luminance Default Offset */
    uint32_t Croff:1;                   /**< bit:     13  Color Space Conversion Red Chrominance Default Offset */
    uint32_t Cboff:1;                   /**< bit:     14  Color Space Conversion Blue Chrominance Default Offset */
    uint32_t :17;                       /**< bit: 15..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_Y2R_SET1_Type;
