zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/component/isi.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_DMA_P_CTRL_OFFSET               (0x48)                                        /**<  (ISI_DMA_P_CTRL) DMA Preview Control Register  Offset */

#define ISI_DMA_P_CTRL_P_FETCH_Pos          0                                              /**< (ISI_DMA_P_CTRL) Descriptor Fetch Control Bit Position */
#define ISI_DMA_P_CTRL_P_FETCH_Msk          (_U_(0x1) << ISI_DMA_P_CTRL_P_FETCH_Pos)       /**< (ISI_DMA_P_CTRL) Descriptor Fetch Control Bit Mask */
#define ISI_DMA_P_CTRL_P_FETCH              ISI_DMA_P_CTRL_P_FETCH_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_DMA_P_CTRL_P_FETCH_Msk instead */
#define ISI_DMA_P_CTRL_P_WB_Pos             1                                              /**< (ISI_DMA_P_CTRL) Descriptor Writeback Control Bit Position */
#define ISI_DMA_P_CTRL_P_WB_Msk             (_U_(0x1) << ISI_DMA_P_CTRL_P_WB_Pos)          /**< (ISI_DMA_P_CTRL) Descriptor Writeback Control Bit Mask */
#define ISI_DMA_P_CTRL_P_WB                 ISI_DMA_P_CTRL_P_WB_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_DMA_P_CTRL_P_WB_Msk instead */
#define ISI_DMA_P_CTRL_P_IEN_Pos            2                                              /**< (ISI_DMA_P_CTRL) Transfer Done Flag Control Position */
#define ISI_DMA_P_CTRL_P_IEN_Msk            (_U_(0x1) << ISI_DMA_P_CTRL_P_IEN_Pos)         /**< (ISI_DMA_P_CTRL) Transfer Done Flag Control Mask */
#define ISI_DMA_P_CTRL_P_IEN                ISI_DMA_P_CTRL_P_IEN_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_DMA_P_CTRL_P_IEN_Msk instead */
#define ISI_DMA_P_CTRL_P_DONE_Pos           3                                              /**< (ISI_DMA_P_CTRL) Preview Transfer Done Position */
#define ISI_DMA_P_CTRL_P_DONE_Msk           (_U_(0x1) << ISI_DMA_P_CTRL_P_DONE_Pos)        /**< (ISI_DMA_P_CTRL) Preview Transfer Done Mask */
#define ISI_DMA_P_CTRL_P_DONE               ISI_DMA_P_CTRL_P_DONE_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_DMA_P_CTRL_P_DONE_Msk instead */
#define ISI_DMA_P_CTRL_MASK                 _U_(0x0F)                                      /**< \deprecated (ISI_DMA_P_CTRL) Register MASK  (Use ISI_DMA_P_CTRL_Msk instead)  */
#define ISI_DMA_P_CTRL_Msk                  _U_(0x0F)                                      /**< (ISI_DMA_P_CTRL) Register Mask  */


/* -------- ISI_DMA_P_DSCR : (ISI Offset: 0x4c) (R/W 32) DMA Preview Descriptor Address Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t P_DSCR:30;                 /**< bit:  2..31  Preview Descriptor Base Address          */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_DMA_P_DSCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_DMA_P_DSCR_OFFSET               (0x4C)                                        /**<  (ISI_DMA_P_DSCR) DMA Preview Descriptor Address Register  Offset */

#define ISI_DMA_P_DSCR_P_DSCR_Pos           2                                              /**< (ISI_DMA_P_DSCR) Preview Descriptor Base Address Position */
#define ISI_DMA_P_DSCR_P_DSCR_Msk           (_U_(0x3FFFFFFF) << ISI_DMA_P_DSCR_P_DSCR_Pos)  /**< (ISI_DMA_P_DSCR) Preview Descriptor Base Address Mask */
#define ISI_DMA_P_DSCR_P_DSCR(value)        (ISI_DMA_P_DSCR_P_DSCR_Msk & ((value) << ISI_DMA_P_DSCR_P_DSCR_Pos))
#define ISI_DMA_P_DSCR_MASK                 _U_(0xFFFFFFFC)                                /**< \deprecated (ISI_DMA_P_DSCR) Register MASK  (Use ISI_DMA_P_DSCR_Msk instead)  */
#define ISI_DMA_P_DSCR_Msk                  _U_(0xFFFFFFFC)                                /**< (ISI_DMA_P_DSCR) Register Mask  */


/* -------- ISI_DMA_C_ADDR : (ISI Offset: 0x50) (R/W 32) DMA Codec Base Address Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t C_ADDR:30;                 /**< bit:  2..31  Codec Image Base Address                 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_DMA_C_ADDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_DMA_C_ADDR_OFFSET               (0x50)                                        /**<  (ISI_DMA_C_ADDR) DMA Codec Base Address Register  Offset */

#define ISI_DMA_C_ADDR_C_ADDR_Pos           2                                              /**< (ISI_DMA_C_ADDR) Codec Image Base Address Position */
#define ISI_DMA_C_ADDR_C_ADDR_Msk           (_U_(0x3FFFFFFF) << ISI_DMA_C_ADDR_C_ADDR_Pos)  /**< (ISI_DMA_C_ADDR) Codec Image Base Address Mask */
#define ISI_DMA_C_ADDR_C_ADDR(value)        (ISI_DMA_C_ADDR_C_ADDR_Msk & ((value) << ISI_DMA_C_ADDR_C_ADDR_Pos))
#define ISI_DMA_C_ADDR_MASK                 _U_(0xFFFFFFFC)                                /**< \deprecated (ISI_DMA_C_ADDR) Register MASK  (Use ISI_DMA_C_ADDR_Msk instead)  */
#define ISI_DMA_C_ADDR_Msk                  _U_(0xFFFFFFFC)                                /**< (ISI_DMA_C_ADDR) Register Mask  */


/* -------- ISI_DMA_C_CTRL : (ISI Offset: 0x54) (R/W 32) DMA Codec Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t C_FETCH:1;                 /**< bit:      0  Descriptor Fetch Control Bit             */
    uint32_t C_WB:1;                    /**< bit:      1  Descriptor Writeback Control Bit         */
    uint32_t C_IEN:1;                   /**< bit:      2  Transfer Done Flag Control               */
    uint32_t C_DONE:1;                  /**< bit:      3  Codec Transfer Done                      */
    uint32_t :28;                       /**< bit:  4..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_DMA_C_CTRL_Type;
